Repository: Wakanda/core-XToolbox
Catalog: JavaScript/Resources/*.lproj/Errors_javascript_*.xlf
Languages: fr

# ERR_jvsc_4000
source: Wrong type for parameter #{p1}, expected File or String.
fr: Type incorrect pour le paramètre #{p1}, File ou Chaîne attendu.

# ERR_jvsc_4001
source: Wrong type for parameter #{p1}, expected String.
fr: Type incorrect pour le paramètre #{p1}, Chaîne attendue.

# ERR_jvsc_4002
source: Wrong type for parameter #{p1}, expected Boolean.
fr: Type incorrect pour le paramètre #{p1}, Booléen attendu.

# ERR_jvsc_4003
source: Wrong type for parameter #{p1}, expected Number.
fr: Type incorrect pour le paramètre #{p1}, Numérique attendu.

# ERR_jvsc_4004
source: Wrong type for parameter #{p1}, expected Folder or String.
fr: Type incorrect pour le paramètre #{p1}, Folder ou Chaîne attendu.

# ERR_jvsc_4005
source: Wrong type for parameter #{p1}, expected DataClass Attribute or String.
fr: Type incorrect pour le paramètre #{p1}, attribut DataClass ou Chaîne attendu.

# ERR_jvsc_4006
source: Wrong type for parameter #{p1}, expected Function.
fr: Type incorrect pour le paramètre #{p1}, Fonction attendue.

# ERR_jvsc_4007
source: Wrong type for parameter #{p1}, expected Object.
fr: Type incorrect pour le paramètre #{p1}, Objet attendu.

# ERR_jvsc_4008
source: Wrong type for parameter #{p1}, expected Buffer.
fr: Type incorrect pour le paramètre #{p1}, Buffer attendu.

# ERR_jvsc_4009
source: Wrong type for parameter #{p1}, expected Array.
fr: Type incorrect pour le paramètre #{p1}, Tableau attendu.

# ERR_jvsc_4010
source: Method or constructor {p1} expects argument(s).
fr: Méthode ou constructeur {p1} attend un ou des argument(s).

# ERR_jvsc_4011
source: Wrong type for parameter #{p1}.
fr: Type incorrect pour le paramètre #{p1}.

# ERR_jvsc_4012
source: Wrong type for parameter #{p1}, expected Entity DataClass or String.
fr: Type incorrect pour le paramètre #{p1}, Entité de DataClass ou Chaîne attendue.

# ERR_jvsc_4013
source: File object must refer to an actual file!
fr: L’objet File doit référencer un fichier réel !

# ERR_jvsc_4014
source: Folder object must refer to an actual folder!
fr: L’objet Folder doit référencer un dossier réel !

# ERR_jvsc_4015
source: Cannot call undefined function object.
fr: Impossible d’appeler un objet fonction non défini.

# ERR_jvsc_4016
source: Cannot call '{p1}'. The expression is not evaluated as a function object.
fr: Impossible d’appeler '{p1}'. L’expression évaluée n'est pas un objet fonction.

# ERR_jvsc_4020
source: Syntax error "{p1}"!
fr: Erreur de syntaxe "{p1}"!

# ERR_jvsc_4021
source: Script "{p1}" not found!
fr: Script "{p1}" inexistant !

# ERR_jvsc_4022
source: Trying to do a structured clone of an unsupported data type (DataCloneError)!
fr: Tentative de faire un clone structuré d’un type de donnée non supporté (DataCloneError) !

# ERR_jvsc_4023
source: Evaluation of require() function implementation ({p1}) failed!
fr: Echec de l'évaluation de l’implémentation de la fonction require() !

# ERR_jvsc_4024
source: SharedWorker ({p1}) cannot be created recursively!
fr: Le SharedWorker ({p1}) ne peut pas être créé de manière récursive !

# ERR_jvsc_4025
source: Trying to reference a neutralized object!
fr: Tentative de référencement d'un objet neutralisé !

# ERR_jvsc_4026
source: Parameter #{p1} is not a valid property for the attribute {p2}.
fr: Le paramètre #{p1} n’est pas une propriété valide pour l’attribut {p2}.

# ERR_jvsc_4050
source: Invalid object state: Method {p1} cannot be called in current state.
fr: Etat invalide de l’objet: La méthode {p1} ne peut pas être appelée dans l’état courant.

# ERR_jvsc_4051
source: Method {p1} is not supported or implemented.
fr: La méthode {p1} n’est pas prise en charge ou implémentée.

# ERR_jvsc_4052
source: Function {p1} does not support all or part of argument {p2}.
fr: La fonction {p1} ne prend pas en charge tout ou partie de l’argument {p2}.

# ERR_jvsc_4053
source: Number given as argument {p1} has invalid value (check range).
fr: Le nombre passé comme argument {p1} a une valeur invalide (check range).

# ERR_jvsc_4054
source: {p1} operation is forbidden.
fr: L’opération {p1} est interdite.

# ERR_jvsc_4055
source: {p1}, line #{p2}, {p3}.
fr: {p1}, ligne #{p2}, {p3}.

# ERR_jvsc_4100
source: Buffer encoding failed!
fr: L’encodage du Buffer a échoué !

# ERR_jvsc_4101
source: Out of bound of Buffer object!
fr: En dehors des limites de l'objet Buffer !

# ERR_jvsc_4102
source: Unsupported or unknown encoding {p1}!
fr: Encodage {p1} non pris en charge ou inconnu !

# ERR_jvsc_4120
source: ArrayBuffer has been neutered.
fr: Le tableau Buffer a été coupé.

# ERR_jvsc_4121
source: Out of bound of TypedArray object!
fr: En dehors des limites de l’objet TypedArray !

# ERR_jvsc_4122
source: Trying to fill a TypedArray with a bigger Array or TypedArray!
fr: Tentative de remplissage d'un TypedArray avec un Array ou TypedArray plus grand !

# ERR_jvsc_4200
source: Socket is already connected!
fr: Le socket est déjà connecté !

# ERR_jvsc_4201
source: Expecting SSL key and certificate (options.key and options.cert)!
fr: Clé et certificat SSL attendus (options.key et options.cert) !

# ERR_jvsc_4300
source: Argument {p1} has invalid file system type (must be TEMPORARY ou PERSISTENT)!
fr: L’argument {p1} a un type fichier système invalide (doit être TEMPORARY ou PERSISTENT)!

# ERR_jvsc_4301
source: Wrong type for parameter #{p1}, expected DirectoryEntry object.
fr: Type incorrect pour le paramètre #{p1}, objet DirectoryEntry attendu.

# ERR_jvsc_4302
source: Wrong type for parameter #{p1}, expected DirectoryEntrySync object.
fr: Type incorrect pour le paramètre #{p1}, objet DirectoryEntrySync attendu.

# ERR_jvsc_4303
source: New name #{p1} must not be an empty string!
fr: Le nouveau nom #{p1} ne doit pas être une chaîne vide !

# ERR_jvsc_4400
source: BinaryStream does not support net.Socket objects! Use net.SocketSync instead.
fr: BinaryStream ne prend pas en charge les objets net.Socket ! Utilisez à la place net.SocketSync.

# ERR_jvsc_4500
source: Unable to retrieve source URL for module loading.
fr: Impossible de trouver la source URL pour le chargement du module.

# ERR_jvsc_4501
source: SSJS module system internal error!
fr: Erreur système interne du module SSJS !

# ERR_jvsc_5121
source: The argument is missing.
fr: L’argument est manquant.

# ERR_jvsc_5122
source: File path is invalid.
fr: Le chemin d’accès au fichier est invalide.

# ERR_jvsc_5123
source: File does not exist.
fr: Le fichier n’existe pas.

# ERR_jvsc_5124
source: Current solution is missing.
fr: La solution courante est manquante.

# ERR_jvsc_5125
source: Wrong argument number.
fr: Nombre d’arguments erroné.

# ERR_jvsc_5126
source: Argument mismatch error.
fr: Erreur argument incompatible.

# ERR_jvsc_6000
source: SyntaxError
fr: Erreur de syntaxe

# ERR_jvsc_6001
source: InvalidAccessError
fr: Erreur accès invalide

# ERR_XHRQ_1000
source: Invalid URL method
fr: Méthode URL invalide

# ERR_XHRQ_1001
source: Dangerous URL method
fr: Méthode URL dangereuse

# ERR_XHRQ_1002
source: Unsupported URL protocol
fr: Protocole d'URL non pris en charge

# ERR_XHRQ_1003
source: Invalid state for requested operation
fr: Etat invalide pour l’opération demandée

# ERR_XHRQ_1004
source: Internal JavaScript binding error
fr: Erreur interne de liaison JavaScript

# ERR_XHRQ_1005
source: Send could not complete
fr: L'envoi n'a pas pu se terminer

# ERR_XHRQ_1008
source: Internal implementation error
fr: Erreur interne d’implémentation

# ERR_XHRQ_1009
source: Unsupported parameter for requested operation
fr: Paramètre non pris en charge pour l’opération demandée

# ERR_CWRP_1101
source: Unsupported protocol
fr: Protocole non pris en charge

# ERR_CWRP_1105
source: Could not resolve proxy
fr: Impossible de résoudre le proxy

# ERR_CWRP_1106
source: Could not resolve hostname
fr: Impossible de résoudre hostname

# ERR_CWRP_1107
source: Could not connect
fr: Impossible de se connecter

# ERR_CWRP_1199
source: Undefined implementation error
fr: Erreur d’implémentation non définie
