Repository: Wakanda/core-XToolbox
Catalog: ServerNet/Resources/*.lproj/ServerNetFR.xlf
Languages: fr

# ERR_srvr_1
source: Read failed
fr: Echec de la lecture

# SNET_UNKNOWN_ERROR
source: Unknown error code
fr: Code d'erreur inconnu

# ERR_srvr_2
source: Write failed
fr: Echec de l'écriture

# ERR_srvr_3
source: Connection is broken
fr: Connexion interrompue

# ERR_srvr_4
source: Connection failed
fr: Echec de la connexion

# ERR_srvr_6
source: End-point is already reading
fr: End-point déjà en cours de lecture

# ERR_srvr_7
source: End-point is not reading
fr: End-point n'est pas en cours de lecture

# ERR_srvr_9
source: Invalid parameter
fr: Paramètre invalide

# ERR_srvr_10
source: Invalid internal state
fr: Etat interne invalide

# ERR_srvr_12
source: Failed to start listener
fr: Echec de l'ouverture du port d'écoute

# ERR_srvr_14
source: Session not found
fr: Session non trouvée

# ERR_srvr_15
source: Postponed session expired
fr: La session temporisée a expiré

# ERR_srvr_16
source: NULL end-point
fr: End-point NULL

# ERR_srvr_17
source: Read failed (timeout error)
fr: Erreur de lecture (timeout)

# ERR_srvr_18
source: Write failed (timeout error)
fr: Erreur d'écriture (timeout)

# ERR_srvr_19
source: Keep-alive failed
fr: Echec du keep-alive

# ERR_srvr_20
source: SSL certificate not found
fr: Certificat SSL non trouvé

# ERR_srvr_5
source: Network resource temporarily unavailable
fr: Resource réseau temporairement indisponible

# ERR_srvr_8
source: Too much sockets to watch
fr: Trop de sockets à surveiller

# ERR_srvr_11
source: Encryption failed
fr: Echec du cryptage

# ERR_srvr_21
source: Can't subscribe to multicast
fr: Impossible de s’abonner au multicast

# ERR_srvr_22
source: Socket already watched
fr: Socket déjà surveillé

# ERR_srvr_23
source: Socket stream is over
fr: Le flux socket est terminé

# ERR_srvr_30
source: Failed to create a connected socket
fr: Echec de création d’un socket connecté

# ERR_srvr_31
source: Failed to create a listening socket
fr: Echec de création d’un socket d’écoute

# ERR_srvr_40
source: Failed to init SSL framework
fr: Echec d’initialisation du framework SSL

# ERR_srvr_41
source: Failed to create a new SSL context
fr: Echec de création d’un nouveau contexte SSL

# ERR_srvr_42
source: SSL read failed
fr: Echec de lecture SSL

# ERR_srvr_43
source: SSL write failed
fr: Echec d’écriture SSL

# ERR_srvr_44
source: SSL shutdown failed
fr: Echec de l’arrêt SSL

# ERR_srvr_45
source: Failed to get SSL certificate
fr: Impossible d’obtenir le certificat SSL

# ERR_srvr_46
source: Failed to set SSL certificate
fr: Echec à la création du certificat SSL

# ERR_srvr_47
source: Failed to get SSL private key
fr: Echec à la réception de la clé privée SSL

# ERR_srvr_48
source: Failed to set SSL private key
fr: Echec à la définition de la clé privée SSL

# ERR_srvr_49
source: SSL internal error : {p1}
fr: Erreur interne SSL : {p1}

# ERR_srvr_50
source: Socket timeout
fr: Timeout socket

# ERR_srvr_51
source: Socket connection broken
fr: Connexion socket interrompue

# ERR_srvr_52
source: Resource unavailable
fr: Ressource indisponible

# ERR_srvr_53
source: Socket read failed
fr: Echec de lecture du socket

# ERR_srvr_54
source: Socket write failed
fr: Echec d’écriture du socket

# ERR_srvr_55
source: Unexpected socket family
fr: Famille socket inattendue

# ERR_srvr_56
source: Failed to secure connection with SSL
fr: Echec de sécurisation de la connexion avec SSL

# ERR_srvr_57
source: Could not set certificate and/or private key
fr: Impossible de définir le certificat et/ou la clé privée

# ERR_srvr_58
source: Socket shut down by peer
fr: Socket fermé par interlocuteur

# ERR_srvr_101
source: Failed to acquire lock
fr: Echec d’acquisition du verrou

# ERR_srvr_102
source: Localizer not available
fr: Localisateur indisponible

# ERR_srvr_103
source: Localization failed
fr: Echec de localisation

# ERR_srvr_301
source: Bonjour name is too long
fr: Le nom Bonjour est trop long

# ERR_srvr_302
source: Do not fit in Bonjour packet
fr: Inadapté au Paquet Bonjour

# ERR_srvr_303
source: Malformed Bonjour packet
fr: Paquet Bonjour mal formé

# ERR_srvr_304
source: Invalid Bonjour attribute
fr: Attribut Bonjour invalide

# ERR_srvr_305
source: Bonjour text should be ASCII
fr: Le texte Bonjour doit être ASCII

# ERR_srvr_306
source: Bonjour network failure
fr: Echec réseau Bonjour

# ERR_srvr_307
source: Bonjour record already exists
fr: Enregistrement Bonjour déjà existant

# ERR_srvr_308
source: Bonjour record not found
fr: Enregistrement Bonjour introuvable

# ERR_srvr_309
source: Bonjour server is not running
fr: Le serveur Bonjour n’est pas lancé

# ERR_srvr_401
source: Need more bytes to get complete frame header.
fr: Besoin de plus d’octets pour avoir la trame de tête complète.

# ERR_srvr_402
source: Frame header is incorrect.
fr: Trame de tête incorrecte.

# ERR_srvr_403
source: Need more bytes to get frame payload.
fr: Besoin de plus d’octets pour avoir la trame payload.

# ERR_srvr_404
source: Invalid state for reading WebSocket.
fr: Etat invalide pour lire le WebSocket.

# ERR_srvr_405
source: Invalid state for writing WebSocket.
fr: Etat invalide pour écrire le WebSocket.

# ERR_srvr_406
source: Invalid state for closing WebSocket.
fr: Etat invalide pour fermer le WebSocket.

# ERR_srvr_407
source: WebSocket operation valid only in OPEN state.
fr: Opération WebSocket valide seulement en état OPEN.

# ERR_srvr_408
source: WebSocket message already started.
fr: Message WebSocket déjà démarré.

# ERR_srvr_409
source: WebSocket message not started.
fr: Message WebSocket non démarré.

# ERR_srvr_410
source: WebSocket protocol error.
fr: Erreur protocole WebSocket.

# ERR_srvr_411
source: WebSocket opening handshake need more bytes.
fr: Le handshake d’ouverture WebSocket a besoin de plus d’octets.

# ERR_srvr_412
source: Connection to WebSocket server failed (not a 101 response).
fr: Echec de connexion au serveur WebSocket (pas une réponse 101).

# ERR_srvr_413
source: Invalid server response (does not comply with WebSocket specificaton).
fr: Réponse serveur invalide (non conforme à la spécification WebSocket).

# ERR_srvr_414
source: Wrong WebSocket acceptance key.
fr: Clé d’acceptation WebSocket incorrecte.

# ERR_srvr_415
source: Invalid WebSocket client request (start of opening handshake).
fr: Requête client WebSocket invalide (début de l’ouverture handshake).

# SQL_ERROR_FAILED_TO_START_SERVER
source: Failed to launch SQL Server. Please make sure that the port assigned to the SQL Server is not used by another application. If SSL is enabled, make sure the certificate (key.pem and cert.pem) exists at the appropriate location.
fr: Echec au lancement du serveur SQL. Vérifiez que le port assigné au serveur SQL n'est pas utilisé par une autre application. Si SSL est actif, vérifiez que les fichiers du certificat (key.pem et cert.pem) sont correctement installés sur le disque.

# SQL_ERROR_FAILED_TO_LOCATE_SSL_CERTIFICATE
source: Failed to launch SQL Server: the SSL certificate files (key.pem/cert.pem) cannot be found.
fr: Echec au lancement du serveur SQL : les fichiers du certificat SSL (key.pem/cert.pem) sont introuvables.
