Repository: Wakanda/core-XToolbox
Catalog: ServerNet/Resources/*.lproj/ServerNetPT-*.xlf
Languages: pt_br

# ERR_srvr_1
source: Read failed
pt_br: Falha de leitura

# SNET_UNKNOWN_ERROR
source: Unknown error code
pt_br: Código de erro desconhecido

# ERR_srvr_2
source: Write failed
pt_br: Falha de escritura

# ERR_srvr_3
source: Connection is broken
pt_br: Conexão interrompida

# ERR_srvr_4
source: Connection failed
pt_br: Falha da conexão

# ERR_srvr_6
source: End-point is already reading
pt_br: End-point em leitura

# ERR_srvr_7
source: End-point is not reading
pt_br: End-point não lendo

# ERR_srvr_9
source: Invalid parameter
pt_br: Parâmetro inválido

# ERR_srvr_10
source: Invalid internal state
pt_br: Estado interno inválido

# ERR_srvr_12
source: Failed to start listener
pt_br: Falha ao iniciar a porta

# ERR_srvr_14
source: Session not found
pt_br: Sessão não encontrada

# ERR_srvr_15
source: Postponed session expired
pt_br: A sessão temporária expirou

# ERR_srvr_16
source: NULL end-point
pt_br: End-point NULL

# ERR_srvr_17
source: Read failed (timeout error)
pt_br: Erro de leitura (timeout)

# ERR_srvr_18
source: Write failed (timeout error)
pt_br: Erro de escrita (timeout)

# ERR_srvr_19
source: Keep-alive failed
pt_br: Falha do keep-alive

# ERR_srvr_20
source: SSL certificate not found
pt_br: Não foi encontrado o certificado SSL

# ERR_srvr_5
source: Network resource temporarily unavailable
pt_br: Recurso de rede temporariamente não disponível

# ERR_srvr_8
source: Too much sockets to watch
pt_br: Muitos sockets para observar

# ERR_srvr_11
source: Encryption failed
pt_br: A encriptação falhou

# ERR_srvr_21
source: Can't subscribe to multicast
pt_br: Não pode se inscrever ao multicast

# ERR_srvr_22
source: Socket already watched
pt_br: Socket já observado

# ERR_srvr_23
source: Socket stream is over
pt_br: O fluxo do socket terminou

# ERR_srvr_30
source: Failed to create a connected socket
pt_br: Falha ao criar um socket conectado

# ERR_srvr_31
source: Failed to create a listening socket
pt_br: Falha ao criar um socket de escuta

# ERR_srvr_40
source: Failed to init SSL framework
pt_br: Falha ao iniciar o framework SSL

# ERR_srvr_41
source: Failed to create a new SSL context
pt_br: Falha ao criar um novo contexto SSL

# ERR_srvr_42
source: SSL read failed
pt_br: Falha de leitura SSL

# ERR_srvr_43
source: SSL write failed
pt_br: Falha de escrita SSL

# ERR_srvr_44
source: SSL shutdown failed
pt_br: Falha ao desligar SSL

# ERR_srvr_45
source: Failed to get SSL certificate
pt_br: Falha ao obter o certificado SSL

# ERR_srvr_46
source: Failed to set SSL certificate
pt_br: Falha ao criar o certificado SSL

# ERR_srvr_47
source: Failed to get SSL private key
pt_br: Falha ao obter a chave privada SSL

# ERR_srvr_48
source: Failed to set SSL private key
pt_br: Falha ao definir a chave privada SSL

# ERR_srvr_49
source: SSL internal error : {p1}
pt_br: erro interno SSL: {p1}

# ERR_srvr_50
source: Socket timeout
pt_br: Timeout Socket

# ERR_srvr_51
source: Socket connection broken
pt_br: Conexão de socket interrompida

# ERR_srvr_52
source: Resource unavailable
pt_br: Recurso não disponível

# ERR_srvr_53
source: Socket read failed
pt_br: Erro ao ler o socket

# ERR_srvr_54
source: Socket write failed
pt_br: Erro ao escrever o socket

# ERR_srvr_55
source: Unexpected socket family
pt_br: Família de socket inesperada

# ERR_srvr_56
source: Failed to secure connection with SSL
pt_br: Falha ao fazer conexão segura com SSL

# ERR_srvr_57
source: Could not set certificate and/or private key
pt_br: Não é possível definir o certificado e/ou a chave privada

# ERR_srvr_58
source: Socket shut down by peer
pt_br: Socket fechado pelo interlocutor

# ERR_srvr_101
source: Failed to acquire lock
pt_br: Falha ao obter o bloqueio

# ERR_srvr_102
source: Localizer not available
pt_br: Localizador não disponível

# ERR_srvr_103
source: Localization failed
pt_br: Falha de localização

# ERR_srvr_301
source: Bonjour name is too long
pt_br: O nome Bonjour é muito longo

# ERR_srvr_302
source: Do not fit in Bonjour packet
pt_br: Não se encaixa ao pacote Bonjour

# ERR_srvr_303
source: Malformed Bonjour packet
pt_br: Pacote Bonjour malformado

# ERR_srvr_304
source: Invalid Bonjour attribute
pt_br: Atributo Bonjour não válido

# ERR_srvr_305
source: Bonjour text should be ASCII
pt_br: O texto Bonjour deve ser ASCII

# ERR_srvr_306
source: Bonjour network failure
pt_br: Erro da rede Bonjour

# ERR_srvr_307
source: Bonjour record already exists
pt_br: O registro Bonjour já existe

# ERR_srvr_308
source: Bonjour record not found
pt_br: Não foi achado o registro Bonjour

# ERR_srvr_309
source: Bonjour server is not running
pt_br: O servidor Bonjour não está funcionando

# ERR_srvr_401
source: Need more bytes to get complete frame header.
pt_br: Mais bytes são necessários para completar o cabeçalho do quadro.

# ERR_srvr_402
source: Frame header is incorrect.
pt_br: O cabeçalho do quadro está incorreto.

# ERR_srvr_403
source: Need more bytes to get frame payload.
pt_br: Mais bytes são necessários para a carga útil e do quadro.

# ERR_srvr_404
source: Invalid state for reading WebSocket.
pt_br: Estado inválido para a leitura do WebSocket.

# ERR_srvr_405
source: Invalid state for writing WebSocket.
pt_br: Estado inválido para escrever no WebSocket.

# ERR_srvr_406
source: Invalid state for closing WebSocket.
pt_br: Estado inválido para fechar o WebSocket.

# ERR_srvr_407
source: WebSocket operation valid only in OPEN state.
pt_br: Operação válida exclusivamente no estado ABERTO do WebSocket.

# ERR_srvr_408
source: WebSocket message already started.
pt_br: O mensagem do WebSocket já começou.

# ERR_srvr_409
source: WebSocket message not started.
pt_br: O mensagem do WebSocket não foi iniciado.

# ERR_srvr_410
source: WebSocket protocol error.
pt_br: Erro de protocolo WebSocket.

# ERR_srvr_411
source: WebSocket opening handshake needs more bytes.
pt_br: A negociação de abertura WebSocket precisa de mais bytes.

# ERR_srvr_412
source: Connection to WebSocket server failed (not a 101 response).
pt_br: A ligação ao servidor WebSocket falhou (não uma resposta 101).

# ERR_srvr_413
source: Invalid server response (does not comply with WebSocket specification).
pt_br: Resposta inválida do servidor (não cumpre as especificações WebSocket).

# ERR_srvr_414
source: Wrong WebSocket acceptance key.
pt_br: Chave de aceitação WebSocket incorreta.

# ERR_srvr_415
source: Invalid WebSocket client request (start of opening handshake).
pt_br: Solicitação inválida do cliente WebSocket (início negociação).

# SQL_ERROR_FAILED_TO_START_SERVER
source: Failed to launch SQL Server. Please make sure that the port assigned to the SQL Server is not used by another application. If SSL is enabled, make sure the certificate (key.pem and cert.pem) exists at the appropriate location.
pt_br: Falha no lançamento do servidor SQL. Por favor, tenha certeza que a porta designada ao servidor SQL não está sendo usada por nenhuma outra aplicação. Se SSL estiver ativado, tenha certeza que os arquivos do certificado (key.pem e cert.pem) estejam corretamente instalados no disco.

# SQL_ERROR_FAILED_TO_LOCATE_SSL_CERTIFICATE
source: Failed to launch SQL Server: the SSL certificate files (key.pem/cert.pem) cannot be found.
pt_br: Falha ao iniciar o servidor SQL: não foram encontrados os arquivos SSL do certificado SSL (key.pem/cert.pem).
