Repository: Wakanda/core-XToolbox
Catalog: ServerNet/Resources/*.lproj/ServerNetES.xlf
Languages: es

# ERR_srvr_1
source: Read failed
es: Falla de lectura

# SNET_UNKNOWN_ERROR
source: Unknown error code
es: Código de error desconocido

# ERR_srvr_2
source: Write failed
es: Falla de escritura

# ERR_srvr_3
source: Connection is broken
es: Conexión interrumpida

# ERR_srvr_4
source: Connection failed
es: Falla de la conexión

# ERR_srvr_6
source: End-point is already reading
es: End-point en lectura

# ERR_srvr_7
source: End-point is not reading
es: End-point no lee

# ERR_srvr_9
source: Invalid parameter
es: Parámetro invalido

# ERR_srvr_10
source: Invalid internal state
es: Estado interno invalido

# ERR_srvr_12
source: Failed to start listener
es: Falla al iniciar el puerto

# ERR_srvr_14
source: Session not found
es: Sesión no encontrada

# ERR_srvr_15
source: Postponed session expired
es: Expiró la sesión temporal

# ERR_srvr_16
source: NULL end-point
es: End-point NULL

# ERR_srvr_17
source: Read failed (timeout error)
es: Error de lectura (timeout)

# ERR_srvr_18
source: Write failed (timeout error)
es: Error de escritura (timeout)

# ERR_srvr_19
source: Keep-alive failed
es: Falla del keep-alive

# ERR_srvr_20
source: SSL certificate not found
es: No se encontró el certificado SSL

# ERR_srvr_5
source: Network resource temporarily unavailable
es: Recurso de red temporalmente no disponible

# ERR_srvr_8
source: Too much sockets to watch
es: Muchos sockets para observar

# ERR_srvr_11
source: Encryption failed
es: La encriptación falló

# ERR_srvr_21
source: Can't subscribe to multicast
es: No se puede suscribir a multicast

# ERR_srvr_22
source: Socket already watched
es: Socket ya observado

# ERR_srvr_23
source: Socket stream is over
es: El flujo del socket finalizó

# ERR_srvr_30
source: Failed to create a connected socket
es: Fallo al crear un socket conectado

# ERR_srvr_31
source: Failed to create a listening socket
es: Fallo al crear un socket de escucha

# ERR_srvr_40
source: Failed to init SSL framework
es: Fallo al iniciar el framework SSL

# ERR_srvr_41
source: Failed to create a new SSL context
es: Fallo al crear un nuevo contexto SSL

# ERR_srvr_42
source: SSL read failed
es: Fallo de lectura SSL

# ERR_srvr_43
source: SSL write failed
es: Fallo de escritura SSL

# ERR_srvr_44
source: SSL shutdown failed
es: Fallo al apagar SSL

# ERR_srvr_45
source: Failed to get SSL certificate
es: Fallo al obtener el certificado SSL

# ERR_srvr_46
source: Failed to set SSL certificate
es: Fallo al crear el certificado SSL

# ERR_srvr_47
source: Failed to get SSL private key
es: Fallo al recibir la llave privada SSL

# ERR_srvr_48
source: Failed to set SSL private key
es: Fallo al definir la llave privada SSL

# ERR_srvr_49
source: SSL internal error : {p1}
es: error interno SSL: {p1}

# ERR_srvr_50
source: Socket timeout
es: Timeout Socket

# ERR_srvr_51
source: Socket connection broken
es: Conexión de socket interrumpida

# ERR_srvr_52
source: Resource unavailable
es: Recurso no disponible

# ERR_srvr_53
source: Socket read failed
es: Error al leer el socket

# ERR_srvr_54
source: Socket write failed
es: Error al escribir el socket

# ERR_srvr_55
source: Unexpected socket family
es: Familia de socket inesperada

# ERR_srvr_56
source: Failed to secure connection with SSL
es: Fallo al asegurar la conexión con SSL

# ERR_srvr_57
source: Could not set certificate and/or private key
es: No se pudo definir el certificado y/o la llave privada

# ERR_srvr_58
source: Socket shut down by peer
es: Socket cerrado por el interlocutor

# ERR_srvr_101
source: Failed to acquire lock
es: Fallo al adquirir el bloqueo

# ERR_srvr_102
source: Localizer not available
es: Localizador no disponible

# ERR_srvr_103
source: Localization failed
es: Fallo de localización

# ERR_srvr_301
source: Bonjour name is too long
es: El nombre Bonjour es muy largo

# ERR_srvr_302
source: Do not fit in Bonjour packet
es: No se ajusta al paquete Bonjour

# ERR_srvr_303
source: Malformed Bonjour packet
es: Paquete Bonjour malformado

# ERR_srvr_304
source: Invalid Bonjour attribute
es: Attibuto Bonjour no válido

# ERR_srvr_305
source: Bonjour text should be ASCII
es: El texto Bonjour debe ser ASCII

# ERR_srvr_306
source: Bonjour network failure
es: Error de red Bonjour

# ERR_srvr_307
source: Bonjour record already exists
es: Registro Bonjour ya existe

# ERR_srvr_308
source: Bonjour record not found
es: No se encontró Registro

# ERR_srvr_309
source: Bonjour server is not running
es: El servidor Bonjour no está corriendo

# ERR_srvr_401
source: Need more bytes to get complete frame header.
es: Se necesitan más bytes para completa el encabezado de la trama.

# ERR_srvr_402
source: Frame header is incorrect.
es: El encabezado de la trama es incorrecto.

# ERR_srvr_403
source: Need more bytes to get frame payload.
es: Se necesitan más bytes para obtener la carga útil de la trama.

# ERR_srvr_404
source: Invalid state for reading WebSocket.
es: Estado inválido para la lectura del WebSocket.

# ERR_srvr_405
source: Invalid state for writing WebSocket.
es: Estado inválido para la escritura del WebSocket.

# ERR_srvr_406
source: Invalid state for closing WebSocket.
es: Estado inválido para cerrar el WebSocket.

# ERR_srvr_407
source: WebSocket operation valid only in OPEN state.
es: Operación válida sólo en el estado ABIERTO del WebSocket.

# ERR_srvr_408
source: WebSocket message already started.
es: El mensaje del WebSocket ya comenzó.

# ERR_srvr_409
source: WebSocket message not started.
es: El mensaje del WebSocket no ha iniciado.

# ERR_srvr_410
source: WebSocket protocol error.
es: Error de protocolo WebSocket.

# ERR_srvr_411
source: WebSocket opening handshake needs more bytes.
es: La negociación de apertura del WebSocket necesita más bytes.

# ERR_srvr_412
source: Connection to WebSocket server failed (not a 101 response).
es: La conexión al servidor WebSocket falló (no una respuesta 101).

# ERR_srvr_413
source: Invalid server response (does not comply with WebSocket specification).
es: Respuesta inválida del servidor (no cumple con las especificaciones WebSocket).

# ERR_srvr_414
source: Wrong WebSocket acceptance key.
es: Clave de aceptación WebSocket incorrecta.

# ERR_srvr_415
source: Invalid WebSocket client request (start of opening handshake).
es: Solicitud invalida del cliente WebSocket (inicio de negociación).

# SQL_ERROR_FAILED_TO_START_SERVER
source: Failed to launch SQL Server. Please make sure that the port assigned to the SQL Server is not used by another application. If SSL is enabled, make sure the certificate (key.pem and cert.pem) exists at the appropriate location.
es: Falla en el lanzamiento del servidor SQL. Por favor asegúrese de que el puerto asignado al servidor SQL no esté siendo utilizado por otra aplicación. Si SSL está activo, asegúrese de que los archivos del certificado (key.pem y cert.pem) estén correctamente instalados en el disco.

# SQL_ERROR_FAILED_TO_LOCATE_SSL_CERTIFICATE
source: Failed to launch SQL Server: the SSL certificate files (key.pem/cert.pem) cannot be found.
es: Falla en el lanzamiento del servidor SQL: no se encontraron los archivos SSL del certificado SSL (key.pem/cert.pem).
