Repository: Wakanda/core-XToolbox
Catalog: ServerNet/Resources/*.lproj/ServerNetDE.xlf
Languages: de

# ERR_srvr_1
source: Read failed with error code {key1} and system error code {key2}
de: Lesen fehlgeschlagen mit Fehlercode {key1} und System-Fehlercode {key2}

# SNET_UNKNOWN_ERROR
source: Unknown error code
de: Unbekannter Fehlercode

# ERR_srvr_2
source: Write failed with error code {key1}
de: Schreiben fehlgeschlagen mit Fehlercode {key1}

# ERR_srvr_3
source: Connection is broken
de: Verbindung ist unterbrochen

# ERR_srvr_4
source: Connection failed
de: Verbindung fehlgeschlagen

# ERR_srvr_6
source: End-point is already reading
de: Endpunkt liest bereits

# ERR_srvr_7
source: End-point is not reading
de: Endpunkt liest nicht

# ERR_srvr_9
source: Invalid parameter
de: Ungültiger Parameter

# ERR_srvr_10
source: Invalid internal state
de: Ungültiger interner Zustand

# ERR_srvr_12
source: Failed to start listener
de: Fehler beim Starten des Listeners

# ERR_srvr_13
source: Failed to create a socket
de: Fehler beim Erzeugen des Sockets

# ERR_srvr_14
source: Session not found
de: Session nicht gefunden

# ERR_srvr_15
source: Postponed session expired
de: Zurückgestellte Session abgelaufen

# ERR_srvr_17
source: Read failed (timeout error)
de: Lesen fehlgeschlagen (Timeout)

# ERR_srvr_18
source: Write failed (timeout error)
de: Schreiben fehlgeschlagen (Timeout)

# ERR_srvr_19
source: Keep-alive failed
de: Keep-alive fehlgeschlagen

# ERR_srvr_20
source: SSL certificate not found
de: SSL Zertifikate nicht gefunden

# ERR_srvr_5
source: Network resource temporarily unavailable
de: Netzwerk-Ressource derzeit nicht verfügbar

# ERR_srvr_8
source: Too much sockets to watch
de: Zu viele Sockets zur Überwachung

# ERR_srvr_11
source: Encryption failed
de: Verschlüsselung fehlgeschlagen

# ERR_srvr_21
source: Can't subscribe to multicast
de: Multicast kann nicht abonniert werden

# ERR_srvr_22
source: Socket already watched
de: Socket wird bereits überwacht

# ERR_srvr_23
source: Socket stream is over
de: Socket Übertragung ist Beendet

# ERR_srvr_30
source: Failed to create a connected socket
de: Fehler beim Erzeugen eines verbundenen Sockets

# ERR_srvr_31
source: Failed to create a listening socket
de: Fehler beim Erzeugen eines lesenden Sockets

# ERR_srvr_40
source: Failed to init SSL framework
de: Fehler beim Initialisieren des SSL Frameworks

# ERR_srvr_41
source: Failed to create a new SSL context
de: Die Erzeugung eines neuen SSL Context ist fehlgeschlagen

# ERR_srvr_42
source: SSL read failed
de: SSL Lesen fehlgeschlagen

# ERR_srvr_43
source: SSL write failed
de: SSL Schreiben fehlgeschlagen

# ERR_srvr_44
source: SSL shutdown failed
de: SSL Shutdown fehlgeschlagen

# ERR_srvr_45
source: Failed to get SSL certificate
de: Abfragen des SSL Zertifikats ist fehlgeschlagen

# ERR_srvr_46
source: Failed to set SSL certificate
de: Setzen des SSL Zertifikats ist fehlgeschlagen

# ERR_srvr_47
source: Failed to get SSL private key
de: Fehler beim Lesen des privaten SSL Schlüssels

# ERR_srvr_48
source: Failed to set SSL private key
de: Fehler beim Schreiben des privaten SSL Schlüssels

# ERR_srvr_49
source: SSL internal error : {p1}
de: SSL Interner Fehler : {p1}

# ERR_srvr_51
source: Socket connection broken
de: Socket Verbindung unterbrochen

# ERR_srvr_52
source: Resource unavailable
de: Ressource nicht verfügbar

# ERR_srvr_53
source: Socket read failed
de: Socket Lesefehler

# ERR_srvr_54
source: Socket write failed
de: Socket Schreibfehler

# ERR_srvr_55
source: Unexpected socket family
de: Nicht erwartete Socket-Familie

# ERR_srvr_56
source: Failed to secure connection with SSL
de: Fehler beim sichern der Verbindung mit SSL

# ERR_srvr_57
source: Could not set certificate and/or private key
de: Zertifikat und/oder privater Schlüssel konnte nicht gesetzt werden

# ERR_srvr_58
source: Socket shut down by peer
de: Socket durch Peer herunterfahren

# ERR_srvr_101
source: Failed to acquire lock
de: Fehler beim Anfordern der Sperre

# ERR_srvr_102
source: Localizer not available
de: Localizer nicht verfügbar

# ERR_srvr_103
source: Localization failed
de: Localization fehlgeschlagen

# ERR_srvr_301
source: Bonjour name is too long
de: Bonjour Name ist zu lang

# ERR_srvr_302
source: Do not fit in Bonjour packet
de: Passt nicht in Bonjour Paket

# ERR_srvr_303
source: Malformed Bonjour packet
de: Ungültiges Bonjour Paket

# ERR_srvr_304
source: Invalid Bonjour attribute
de: Ungültiges Bonjour Attribut

# ERR_srvr_305
source: Bonjour text should be ASCII
de: Bonjour Text muss ASCII sein

# ERR_srvr_307
source: Bonjour record already exists
de: Bonjour Datensatz existiert bereits

# ERR_srvr_308
source: Bonjour record not found
de: Bonjour Datensatz nicht gefunden

# ERR_srvr_309
source: Bonjour server is not running
de: Bonjour Server läuft nicht

# ERR_srvr_401
source: Need more bytes to get complete frame header.
de: Zusätzliche Bytes nötig um vollständigen Frame Header zu lesen.

# ERR_srvr_402
source: Frame header is incorrect.
de: Frame Header ist ungültig.

# ERR_srvr_403
source: Need more bytes to get frame payload.
de: Zusätzliche Bytes nötig um Frame Payload zu lesen.

# ERR_srvr_404
source: Invalid state for reading WebSocket.
de: Ungültiger Status um WebSocket zu lesen.

# ERR_srvr_405
source: Invalid state for writing WebSocket.
de: Ungültiger Status um WebSocket zu schreiben.

# ERR_srvr_406
source: Invalid state for closing WebSocket.
de: Ungültiger Status um WebSocket zu schließen.

# ERR_srvr_407
source: WebSocket operation valid only in OPEN state.
de: WebSocket Operation nur in OPEN Status gültig.

# ERR_srvr_408
source: WebSocket message already started.
de: WebSocket Nachricht bereits begonnen.

# ERR_srvr_409
source: WebSocket message not started.
de: WebSocket Nachricht nicht begonnen.

# ERR_srvr_410
source: WebSocket protocol error.
de: WebSocket Protokoll Fehler.

# ERR_srvr_411
source: WebSocket opening handshake needs more bytes.
de: WebSocket Eröffnungs-Handshake benötigt mehr Bytes.

# ERR_srvr_412
source: Connection to WebSocket server failed (not a 101 response).
de: Verbindung zu WebSocket Server fehlgeschlagen (keine 101 Antwort).

# ERR_srvr_413
source: Invalid server response (does not comply with WebSocket specification).
de: Ungültige Serverantwort (entspricht nicht der WebSocket Spezifikation).

# ERR_srvr_414
source: Wrong WebSocket acceptance key.
de: Fehlerhafter WebSocket Acceptance Key.

# ERR_srvr_415
source: Invalid WebSocket client request (start of opening handshake).
de: Ungültige WebSocket Client Anfrage (Start des Eröffnungs-Handshake).

# SQL_ERROR_FAILED_TO_START_SERVER
source: Failed to launch SQL Server. Please make sure that the port assigned to the SQL Server is not used by another application. If SSL is enabled, make sure the certificate (key.pem and cert.pem) exists at the appropriate location.
de: SQL Server konnte nicht gestartet werden. Bitte stellen Sie sicher, das der zugewiesene Port für SQL Server nicht bereits von einer anderen Anwendung benutzt wird. Wenn SSL aktiviert ist, prüfen Sie ob die Zertifikate (key.pem und cert.pem) korrekt installiert sind.

# SQL_ERROR_FAILED_TO_LOCATE_SSL_CERTIFICATE
source: Failed to launch SQL Server: the SSL certificate files (key.pem/cert.pem) cannot be found.
de: SQL Server konnte nicht gestartet werden: die SSL-Zertifikate (key.pem und cert.pem) wurden nicht gefunden.
