Repository: Wakanda/core-XToolbox
Catalog: Kernel/Resources/*.lproj/Errors_xbox_*.xlf
Languages: de, es, fr, ja, pt_br

# ERR_xbox_100
source: Memory allocation failed
de: Speicherzuordnung fehlgeschlagen
es: Falla en asignación de memoria
fr: L'allocation de la mémoire a échoué
ja: メモリの割当に失敗しました
pt_br: Erro na alocação de memória

# ERR_xbox_107
source: String allocation failed
de: Speicheranforderung für Text fehlgeschlagen
es: Falla en Asignación de texto
fr: Une allocation de texte a échoué
ja: 文字列の割り当てに失敗しました
pt_br: Falha na alocação de texto

# ERR_xbox_200
source: Attempt to read beyond end of stream
de: Versuch nach Ende des Streams zu lesen
es: Intento de lectura más allá del fin del flujo
fr: Tentative de lecture au delà de la fin d'un flux de données
ja: ストリームの終端を超えた読み込みを行おうとしました
pt_br: Tentativa de leitura além do fim do fluxo

# ERR_xbox_208
source: No text converter to read the stream
es: No hay conversor de texto para leer el flujo de datos
fr: Pas de convertisseur texte pour lire le flux de données
ja: ストリームを読み込むためのテキストコンバーターがありません
pt_br: Nenhum conversor de texto para ler o fluxo de dados

# ERR_xbox_300
source: Text conversion failed
de: Textkonvertierung fehlgeschlagen
es: Falla en la conversión de texto
fr: La conversion du texte a échoué
ja: テキストの変換に失敗しました
pt_br: Erro na conversão de texto

# ERR_xbox_303
source: Failed to initialize ICU library
de: Initialisierung der ICU Bibliothek fehlgeschlagen
es: Fallo al iniciar librería ICU
fr: Echec d'initialisation de la librairie ICU
ja: ICUライブラリの初期化に失敗しました
pt_br: Erro ao iniciar a biblioteca ICU

# ERR_xbox_304
source: Regex error {message} while parsing pattern "{pattern}"
de: Regex Fehler {message} beim Analysieren des Musters "{pattern}"
es: Error regex {message} al analizar el patrón "{pattern}"
fr: Erreur regex {message} pendant l'analyse du motif "{pattern}"
ja: "{pattern}" を解析中に、正規表現エラー {message} が発生しました
pt_br: Erro regex {message} ao analizar o padrão "{pattern}"

# ERR_xbox_550
source: JSON malformed in {source}line {line}, position {position}.
es: JSON deforme en {source}, línea {line}, posición {position}.
ja: JSONが正しくありません: ソース {source} 行 {line} 列 {position}
pt_br: JSON deformado {source}, linha {line}, posição {position}.

# ERR_xbox_551
source: JSON malformed. Found '{found}', was expecting: {expected}.
es: JSON deforme. Se encontró '{found}', se esperaba: {expected}.
ja: JSONが正しくありません。Found '{found}', was expecting: {expected}.
pt_br: JSON deformado. Encontrado '{found}', esperado: {expected}.

# ERR_xbox_552
source: JSON malformed. Unterminated {token}.
es: JSON deforme. {token} sin terminar.
ja: JSONが正しくありません。{token}が終了されていません。
pt_br: JSON deformado. {token} inacabado.

# ERR_xbox_553
source: JSON malformed. Extra comma before {token}.
es: JSON deforme. Coma extra antes de {token}.
ja: JSONが正しくありません。{token}の前のコンマが不要です。
pt_br: JSON deformado. Vírgula extra antes {token}.

# ERR_xbox_554
source: JSON malformed. Was expecting: {expected}.
es: JSON deforme. Se esperaba: {expected}.
ja: JSONが正しくありません。{expected}が足りません。
pt_br: JSON deformado. Esperado: {expected}.

# ERR_xbox_600
source: File "{name}" not found ({path})
de: Datei "{name}" nicht gefunden ({path})
es: Archivo "{name}" no encontrado ({path})
ja: ファイル "{name}" が見つかりません: ({path})
pt_br: Arquivo "{name}" não encontrado ({path})

# ERR_xbox_601
source: Cannot rename file "{name}" to "{newname}" ({path})
de: Datei "{name}" kann nicht in "{newname}" umbenannt werden ({path})
es: No es posible renombrar el archivo "{name}" to "{newname}" ({path})
ja: ファイル名 "{name}" を "{newname}" に変更できません: ({path})
pt_br: Não é possível renomear o arquivo "{name}" por "{newname}" ({path})

# ERR_xbox_602
source: Cannot open file "{name}" ({path})
de: Datei "{name}" kann nicht geöffnet werden ({path})
es: No es posible abrir el archivo "{name}" ({path})
ja: ファイル "{name}" を開くことができません: ({path})
pt_br: Não é possível abrir o arquivo "{name}" ({path})

# ERR_xbox_603
source: Cannot close file "{name}" ({path})
de: Datei "{name}" kann nicht geschlossen werden ({path})
es: No es posible cerrar el archivo "{name}" ({path})
ja: ファイル "{name}" を閉じることができません: ({path})
pt_br: Não é possível fechar o arquivo "{name}" ({path})

# ERR_xbox_604
source: Cannot delete "{name}" ({path})
de: Datei "{name}" kann nicht geschlossen/gelöscht werden ({path})
es: No es posible borrar "{name}" ({path})
ja: "{name}" ({path}) を削除できません。
pt_br: Não é possível apagar "{name}" ({path})

# ERR_xbox_605
source: Cannot copy file {path} to {destination}.
de: Datei {path} kann nicht in Ziel {destination} kopiert werden.
es: No es posible copiar el archivo {path} en {destination}.
fr: Impossible de copier le fichier {path} vers {destination}.
ja: ファイル {path} を {destination} にコピーすることができません。
pt_br: Não é possível copiar o arquivo {path} em {destination}.

# ERR_xbox_606
source: Cannot move file {path} to {destination}.
de: Datei {path} kann nicht in Ziel {destination} verschoben werden.
es: No es posible mover el archivo {path} a {destination}.
fr: Impossible de déplacer le fichier {path} vers {destination}.
ja: ファイル {path} を {destination} に移動することができません。
pt_br: Não é possível mover o arquivo {path} a {destination}.

# ERR_xbox_607
source: Cannot create file {path}.
de: Datei {path} kann nicht erzeugt werden.
es: No es posible crear archivo {path}.
fr: Impossible de créer le fichier {path}.
ja: ファイル {path} を作成することができません。
pt_br: Não é possível criar arquivo {path}.

# ERR_xbox_608
source: Cannot get attributes on file {path}.
de: Attribute für Datei {path} können nicht abgefragt werden.
es: No es posible obtener los atributos en el archivo {path}.
fr: Ne peut lire les attributs du fichier {path}.
ja: ファイル {path} の属性を取得できません。
pt_br: Não é possível obter os atributos no arquivo {path}.

# ERR_xbox_609
source: Cannot set attributes on file {path}.
de: Attribute für Datei {path} können nicht gesetzt werden.
es: No es posible asignar atributos en el archivo {path}.
fr: Impossible de fixer les attributs du fichier {path}.
ja: ファイル {path} の属性を設定できません。
pt_br: Não é possível designar atributos no arquivo {path}.

# ERR_xbox_610
source: Cannot create alias on file {path}.
de: Für Datei {path} kann kein Alias/Verknüpfung erzeugt werden.
es: No es posible crear un alias en el archivo {path}.
fr: Impossible de créer l'alias du fichier {path}.
ja: ファイル {path} のエイリアスを作成できません。
pt_br: Não é possível criar um alias no arquivo {path}.

# ERR_xbox_611
source: Cannot resolve alias file {path}.
de: Alias/Verknüpfung für {path} kann nicht aufgelöst werden.
es: No es posible resolver el alias en el archivo {path}.
fr: Impossible de résoudre l'alias du fichier {path}.
ja: ファイル {path} のエイリアスを解決できません。
pt_br: Não é possível resolver o alias no arquivo {path}.

# ERR_xbox_612
source: Cannot reveal file {path}.
de: Datei {path} kann nicht angezeigt werden.
es: No es posible revelar el archivo {path}.
fr: Impossible de montrer le fichier {path}.
ja: ファイル {path} を表示できません。
pt_br: Não é possível revelar o arquivo {path}.

# ERR_xbox_613
source: Invalid file kind for file {path}.
de: Ungültiger Typ für Datei {path}.
es: Clase de archivo inválido para el archivo {path}.
fr: Type invalide pour le fichier {path}.
ja: ファイル {path} の種類が無効です。
pt_br: Classe de arquivo inválido para o arquivo {path}.

# ERR_xbox_614
source: "{newname}" is an invalid name for file {path}.
de: "{newname}" ist ein ungültiger Name für Datei {path}.
es: "{newname}" es un nombre inválido para el archivo {path}.
ja: "{newname}" は無効な名前です: {path}
pt_br: "{newname}" é um nome inválido para o arquivo {path}.

# ERR_xbox_616
source: File {path} already exists.
de: Datei {path} existiert bereits
es: El archivo {path} ya existe.
fr: Le fichier {path} existe déjà.
ja: ファイル {path} は既に存在します。
pt_br: Arquivo {path} já existe.

# ERR_xbox_617
source: Cannot resolve alias file "{path}" to a file.
es: No es posible resolver el alias "{path}" a un archivo.
ja: ファイルへのエイリアスファイル "{path}" を解決できません。
pt_br: Não é possível resolver o alias "{path}" para um arquivo.

# ERR_xbox_618
source: Cannot resolve alias file "{path}" to a folder.
es: No es posible resolver el alias "{path}" a una carpeta.
ja: フォルダーへのエイリアスファイル "{path}" を解決できません。
pt_br: Não é possível resolver o alias "{path}" para uma pasta.

# ERR_xbox_650
source: Folder "{name}" not found ({path}).
de: Ordner "{name}" nicht gefunden ({path}).
es: La carpeta "{name}" no se encontró ({path}).
ja: フォルダー "{name}" が見つかりません。 ({path})
pt_br: A pasta "{name}" não foi encontrada ({path}).

# ERR_xbox_651
source: Folder {path} not empty.
de: Ordner {path} ist leer.
es: La carpeta {path} no está vacía.
fr: Dossier {path} non vide.
ja: フォルダー {path} が空ではありません。
pt_br: A pasta {path} não está vazia.

# ERR_xbox_652
source: Cannot create folder {path}.
de: Ordner kann nicht erzeugt werden {path}.
es: No es posible crear la carpeta {path}.
fr: Impossible de créer le dossier {path}.
ja: フォルダー {path} を作成できません。
pt_br: Não é possível criar a pasta {path}.

# ERR_xbox_653
source: Cannot delete folder {path}.
de: Ordner kann nicht gelöscht werden {path}.
es: No es posible borrar la carpeta {path}.
fr: Impossible de supprimer le dossier {path}.
ja: フォルダー {path} を削除できません。
pt_br: Não é possível apagar a pasta {path}.

# ERR_xbox_654
source: Cannot get attributes on folder {path}.
de: Attribute für Ordner {path} können nicht abgefragt werden.
es: No es posible obtener los atributos en la carpeta {path}.
fr: Impossible de lire les attributs du dossier {path}.
ja: フォルダー {path} の属性を取得できません。
pt_br: Não é possível obter os atributos na pasta {path}.

# ERR_xbox_655
source: Cannot set attributes on folder {path}.
de: Attribute für Ordner {path} können nicht gesetzt werden.
es: No es posible definir atributos en la carpeta {path}.
fr: Impossible de fixer les attributs du dossier {path}.
ja: フォルダー {path} の属性を設定できません。
pt_br: Não é possível definir atributos na pasta {path}.

# ERR_xbox_656
source: Cannot reveal folder {path}.
de: Ordner kann nicht angezeigt werden {path}.
es: No es posible revelar la carpeta {path}.
fr: Impossible de montrer le dossier {path}.
ja: フォルダー {path} を表示できません。
pt_br: Não é possível revelar a pasta {path}.

# ERR_xbox_657
source: Cannot rename folder "{name}" to "{newname}" ({path})
de: Der Ordner "{name}" kann nicht in "{newname}" umbenannt werden ({path})
es: No es posible renombrar la carpeta "{name}" to "{newname}" ({path})
ja: フォルダー "{name}" を "{newname}" に名称変更できません: ({path})
pt_br: Não é possível renomear a pasta "{name}" por "{newname}" ({path})

# ERR_xbox_658
source: Disk full ({path})
de: Festplatte ist voll ({path})
es: Disco lleno ({path})
fr: Disque plein ({path})
ja: ディスクがいっぱいです ({path})
pt_br: Disco cheio ({path})

# ERR_xbox_659
source: Folder {path} already exists.
es: La carpeta {path} ya existe.
fr: Le dossier {path} existe déjà.
ja: フォルダー {path} は既に存在します。
pt_br: A pasta {path} já existe.

# ERR_xbox_660
source: Can't copy {path} into child folder {destination}.
es: No se puede copiar {path} dentro de la carpeta {destination}.
fr: Impossible de copier {path} dans le dossier enfant {destination}.
ja: {path} を {destination} にコピーできません。
pt_br: Não é possível copiar {path} na pasta de destino {destination}.

# ERR_xbox_661
source: Can't move {path} into trash.
es: No se puede pasar {path} a la papelera.
fr: Impossible de placer {path} dans la corbeille.
ja: {path} をゴミ箱に移動できません。
pt_br: NNão pode passar {path} para o lixo.

# ERR_xbox_680
source: Path to file system is not correctly encoded.
es: La ruta al sistema de archivos no está codificada correctamente
pt_br: O caminho para o sistema de arquivos não está codificado corretamente

# ERR_xbox_681
source: Operation is not authorized on this file system.
es: La operación no está permitida en este sistema de archivos
pt_br: A operação não é permitido neste sistema de arquivos

# ERR_xbox_682
source: File or folder not found.
es: Archivo o carpeta no encontrado
fr: Le fichier ou dossier n'a pas été trouvé.
pt_br: Arquivo ou pasta não encontrado

# ERR_xbox_683
source: File system is not in valid state.
es: El sistema de archivos no está en un estado válido
pt_br: O sistema de arquivo não está em um estado válido

# ERR_xbox_684
source: Attempting to write or modify a non-writable file system.
es: Intentando escribir en un sistema de archivos de solo lectura.
pt_br: Tentando escrever em um arquivo somente leitura.

# ERR_xbox_685
source: File system is full.
es: El sistema de archivos está lleno
pt_br: O sistema de arquivos está cheio

# ERR_xbox_686
source: Invalid name '{name}' for a file system.
es: Nombre no válido '{name}' para un archivo del sistema.
ja: '{name}'は有効なファイルシステム名ではありません。
pt_br: Nome inválido '{name}' para um arquivo do sistema.

# ERR_xbox_687
source: Can't load file system definition file {path}.
es: No se puede cargar el archivo de definición del sistema de archivos {path}.
ja: ファイルシステム定義ファイル{path}をロードすることができません。
pt_br: Não é possível carregar o arquivo de definição do sistema de arquivos {path}.

# ERR_xbox_900
source: JSON cannot stringify cyclic structures.
es: JSON no puede pasar a cadenas estructuras cíclicas.
ja: JSONは循環的な構造を文字列化できません。
pt_br: JSON não pode passar estruturas cíclicas para string.

# ERR_xmlc_1
source: {systemID}, line:{line}, column:{column}
de: {systemID}, Zeile:{line}, Spalte:{column}
es: {systemID}, línea:{line}, columna:{column}
fr: {systemID}, ligne:{line}, colonne:{column}
ja: {systemID}, 行:{line}, 列:{column}
pt_br: {systemID}, linha:{line}, coluna:{column}

# ERR_xbox_680
source: Path to file system is not correctly encoded!
ja: ファイルシステムへのパスが正しくエンコードされていません。

# ERR_xbox_681
source: Operation is not authorized on this file system!
ja: このファイルシステム上で操作は許可されていません。

# ERR_xbox_682
source: File or folder not found!
ja: ファイルまたはフォルダーが見つかりません。

# ERR_xbox_683
source: File system is not in valid state!
ja: ファイルシステムが有効な状態ではありません。

# ERR_xbox_684
source: Attempting to write or modify a non-writable file system!
ja: 書き込み不可のファイルシステムに書き込みまたは更新を行おうとしています。

# ERR_xbox_685
source: File system is full!
ja: ファイルシステムがいっぱいです。

# ERR_xbox_600
source: File "{name}" not found ({path})
fr: Fichier "{name}" non trouvé ({path})

# ERR_xbox_601
source: Cannot rename file "{name}" to "{newname}" ({path})
fr: Impossible de renommer le fichier "{name}" en "{newname}" ({path})

# ERR_xbox_602
source: Cannot open file "{name}" ({path})
fr: Impossible d'ouvrir le fichier "{name}" ({path})

# ERR_xbox_603
source: Cannot close file "{name}" ({path})
fr: Impossible de fermer le fichier "{name}" ({path})

# ERR_xbox_604
source: Cannot delete "{name}" ({path})
fr: Impossible de supprimer le fichier "{name}" ({path})

# ERR_xbox_614
source: "{newname}" is an invalid name for file {path}.
fr: "{newname}" est un nom invalide pour le fichier {path}.

# ERR_xbox_617
source: Cannot resolve alias file "{path}" to a file.
de: Alias "{path}" kann nicht in Datei aufgelöst werden.
fr: Impossible de résoudre l’alias "{path}" vers un fichier.

# ERR_xbox_618
source: Cannot resolve alias file "{path}" to a folder.
de: Alias "{path}" kann nicht in Ordner aufgelöst werden.
fr: Impossible de résoudre l’alias "{path}" vers un dossier.

# ERR_xbox_650
source: Folder "{name}" not found ({path}).
fr: Dossier "{name}" non trouvé ({path}).

# ERR_xbox_657
source: Cannot rename folder "{name}" to "{newname}" ({path})
fr: Impossible de renommer le dossier "{name}" en "{newname}" ({path})
